{
  "Pepper__bell___Bacterial_spot": {
    "Treatment": [
      " Step-1: Remove infected parts: Remove and discard any infected plant parts.",
      " Step-2: Spray with fungicide: Use organic or copper-based fungicides.",
      " Step-3: Practice crop rotation: Avoid planting the same species in the same location for at least three years.",
      " Step-4: Treat seeds: Use bleach or hot water treatment on seeds.",
      " Step-5: Mulch plants: Mulch deeply with organic material like newspaper covered with straw or grass clippings."
    ]
  },
  "Pepper__bell___healthy": {
    "Treatment": ["Your plant is healthy."]
  },
  "Potato___Early_blight": {
    "Treatment": [
      " Step-1: Prune or stake plants for air circulation.",
      " Step-2: Disinfect pruning shears with bleach.",
      " Step-3: Keep soil clean, add organic compost.",
      " Step-4: Use drip irrigation to keep foliage dry.",
      " Step-5: Apply copper-based fungicides early or when disease appears."
    ]
  },
  "Potato___Late_blight": {
    "Treatment": [
      " Step-1: Plant resistant cultivars.",
      " Step-2: Remove volunteers and space plants for air circulation.",
      " Step-3: Water in the early morning hours, avoid overhead irrigation.",
      " Step-4: Destroy tomato and potato debris after harvest."
    ]
  },
  "Potato___healthy": {
    "Treatment": ["Your plant is healthy."]
  },
  "Tomato_Bacterial_spot": {
    "Treatment": [
      " Step-1: Infected plants cannot be cured.",
      " Step-2: Remove and dispose of symptomatic plants.",
      " Step-3: Prevent in the future by using pathogen-free seed or transplants."
    ]
  },
  "Tomato_Early_blight": {
    "Treatment": [
      " Step-1: Prune or stake plants for air circulation.",
      " Step-2: Disinfect pruning shears with bleach.",
      " Step-3: Keep soil clean, add organic compost.",
      " Step-4: Use drip irrigation to keep foliage dry.",
      " Step-5: Apply copper-based fungicides early or when disease appears."
    ]
  },
  "Tomato_Late_blight": {
    "Treatment": [
      " Step-1: Plant resistant cultivars.",
      " Step-2: Remove volunteers and space plants for air circulation.",
      " Step-3: Water in the early morning hours, avoid overhead irrigation.",
      " Step-4: Destroy tomato and potato debris after harvest."
    ]
  },
  "Tomato_Leaf_Mold": {
    "Treatment": [
      " Step-1: Let plants air out and dry.",
      " Step-2: Water in early morning to keep leaves dry.",
      " Step-3: Use drip irrigation or soak watering methods."
    ]
  },
  "Tomato_Septoria_leaf_spot": {
    "Treatment": [
      " Step-1: Remove diseased leaves, stake or cage plants for better airflow.",
      " Step-2: Mulch around the base of plants.",
      " Step-3: Avoid overhead watering, control weeds.",
      " Step-4: Use crop rotation, do not plant tomatoes in the same location for 1-2 years."
    ]
  },
  "Tomato_Spider_mites_Two_spotted_spider_mite": {
    "Treatment": [
      " Step-1: Spray with water to dislodge mites.",
      " Step-2: Use insecticidal soap or homemade remedies.",
      " Step-3: Apply neem oil as a pest repellent."
    ]
  },
  "Tomato__Target_Spot": {
    "Treatment": [
      " Step-1: Remove infected leaves, improve airflow.",
      " Step-2: Water in the morning, apply mulch.",
      " Step-3: Use fungicides at regular intervals.",
      " Step-4: Avoid overhead irrigation, inspect seedlings for symptoms."
    ]
  },
  "Tomato__Tomato_YellowLeaf__Curl_Virus": {
    "Treatment": [
      " Step-1: Cover symptomatic plants with a plastic bag and tie at the stem.",
      " Step-2: Cut off the plant below the bag and allow it to desiccate for 1-2 days.",
      " Step-3: Dispose of the plant to remove virus reservoir and trap whiteflies."
    ]
  },
  "Tomato__Tomato_mosaic_virus": {
    "Treatment": [
      " Step-1: Monitor for symptoms and remove infected plants.",
      " Step-2: Remove debris and avoid working in the garden when wet.",
      " Step-3: Avoid using tobacco, spray with a baking soda solution.",
      " Step-4: Soak tools in a bleach solution."
    ]
  },
  "Tomato_healthy": {
    "Treatment": ["Your plant is healthy."]
  }
}
